dataset_gen/Earlier_Datasets/OpenFoam_Shapes/Square/design_points/design_point_2/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-0.94532445
-0.69812629
-0.45092812
-0.20372995
0.043468212
0.29066638
0.53786455
0.78506271
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
3.3875398
3.4125398
3.4375398
3.4625398
3.4875398
3.5125398
3.5375398
3.5625398
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-0.9999602
-0.7499602
-0.4999602
-0.2499602
3.98e-05
0.2500398
0.5000398
0.7500398
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
8.7500398
8.5000398
8.2500398
8.0000398
7.7500398
7.5000398
7.2500398
7.0000398
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform -15;
    }
    Outlet
    {
        type            calculated;
        value           uniform 15;
    }
}


// ************************************************************************* //
